#preprocessor settings
string_midi_pitches = [40,45,50,55,59,64] # открытый лад каждой струны в midi нотах, 1 струна - 40, 2 - 45 и т.д.
highest_fret = 19 # количество ладов, 19 - классическая гитара
num_classes = highest_fret + 2 # число классов - количество ладов + открытый лад + когда струна не играется

need_to_downsample = True # нужно ли понижение частоты дискретизации
need_to_normalize = True # нужна ли нормализация входных треков
sr_downs = 22050 # sampling rate понижения - частота дискретизации, к которой будут понижены входные треки

cqt_n_bins = 192 # количество бинов на рассматриваемый диапазон - 8 октав по 24 бина
cqt_bins_per_octave = 24 # сколько бинов в октаве
hop_length = 512 #длина фрейма в герцах
# длина фрейма в секундах - hop_length / sr
# каждый фрейм при 512 фреймах и частоте 22050 равен 512 / 22050 = 0.02321995464 секунды, т.е. 23мс

#model settings
con_win_size = 9 # количество фреймов в окне, нечетное, т.к. из аннотаций именно центр лада будет указываться
halfwin = con_win_size // 2 # половина окна
num_classes = num_classes # количество классов - см. выше
num_strings = 6 # количество струн
input_shape = (cqt_n_bins, con_win_size, 1) # формат входных данных CNN
train_split = 0.90 # разделение на трейн и тест
epochs = 8 # число эпох

batch_size = 128 # размер батча генератора
shuffle = True # перемешивание в генераторе

#data paths
mic_path = './GuitarSet/audio/mic/' # путь к исходному датасету (записи с микрофона)
annotations_path = './GuitarSet/annotation/' # путь к описанию датасета (аннотации)

dataset_path = './data/repr/' # путь к предобработанному датасету
ids_path = './data/ids.csv' # путь к описанию каждого фрагмента датасета
weights_path = './data/output/weights.h5' # путь к сохраненным значениям весов CNN